ws-Client/target/classes/HelloWorld.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://service.spring.demo/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" name="HelloWorldwsImplService" targetNamespace="http://service.spring.demo/">
  <wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://service.spring.demo/" elementFormDefault="unqualified" targetNamespace="http://service.spring.demo/" version="1.0">
<xs:element name="Person" type="tns:personDto"/>
<xs:element name="sayHi" type="tns:sayHi"/>
<xs:element name="sayHiResponse" type="tns:sayHiResponse"/>
<xs:element name="sayPerson" type="tns:sayPerson"/>
<xs:element name="sayPersonResponse" type="tns:sayPersonResponse"/>
<xs:complexType name="sayPerson">
    <xs:sequence>
      <xs:element minOccurs="0" name="arg0" type="tns:personDto"/>
    </xs:sequence>
  </xs:complexType>
<xs:complexType name="personDto">
    <xs:sequence>
      <xs:element minOccurs="0" name="age" type="xs:int"/>
      <xs:element minOccurs="0" name="name" type="xs:string"/>
    </xs:sequence>
  </xs:complexType>
<xs:complexType name="sayPersonResponse">
    <xs:sequence>
      <xs:element minOccurs="0" name="return" type="tns:personDto"/>
    </xs:sequence>
  </xs:complexType>
<xs:complexType name="sayHi">
    <xs:sequence>
      <xs:element minOccurs="0" name="arg0" type="xs:string"/>
    </xs:sequence>
  </xs:complexType>
<xs:complexType name="sayHiResponse">
    <xs:sequence>
      <xs:element minOccurs="0" name="return" type="xs:string"/>
    </xs:sequence>
  </xs:complexType>
</xs:schema>
  </wsdl:types>
  <wsdl:message name="sayPersonResponse">
    <wsdl:part element="tns:sayPersonResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="sayHiResponse">
    <wsdl:part element="tns:sayHiResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="sayPerson">
    <wsdl:part element="tns:sayPerson" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="sayHi">
    <wsdl:part element="tns:sayHi" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="HelloWorldws">
    <wsdl:operation name="sayPerson">
      <wsdl:input message="tns:sayPerson" name="sayPerson">
    </wsdl:input>
      <wsdl:output message="tns:sayPersonResponse" name="sayPersonResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sayHi">
      <wsdl:input message="tns:sayHi" name="sayHi">
    </wsdl:input>
      <wsdl:output message="tns:sayHiResponse" name="sayHiResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="HelloWorldwsImplServiceSoapBinding" type="tns:HelloWorldws">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="sayPerson">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="sayPerson">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="sayPersonResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sayHi">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="sayHi">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="sayHiResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="HelloWorldwsImplService">
    <wsdl:port binding="tns:HelloWorldwsImplServiceSoapBinding" name="HelloWorldwsImplPort">
      <soap:address location="http://192.168.0.102:8080/cxfWSTest/services/HelloWorld"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>