ws-Server/src/main/java/demo/spring/service/NewFile.xml

<?xml version="1.0" encoding="UTF-8"?>

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsse:UsernameToken wsu:Id="UsernameToken-172677CAD59C01B7CD14281327777641">
				<wsse:Username>joe</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<soap:Body>
		<ns2:sayHi xmlns:ns2="http://service.spring.demo/">
			<arg0>fsd</arg0>
		</ns2:sayHi>
	</soap:Body>
</soap:Envelope>
